// // human  　名言
// var meigen_human = ['追いかけ続ける勇気さえあれば、夢は必ず叶います',
// '勝ち負けなんか、ちっぽけなこと。大事なことは、本気だったかどうかだ',
// '一度失敗したからといって、すべてが失敗するわけじゃないわ',
// '人生には解決法なんかないんだ。あるのは、前に進む力だけだ',
// '常に自分らしくし、自分を表現し、自分を信じよう',
// '人生は一度きりですが、しっかりと生きたなら一度で十分なのです',
// '周囲のためにあなたが小さくなる必要はありません',
// '大変なときこそ、動き続けることが人生の鍵になる',
// '打ちのめされたかどうかではなく、立ち上がったかどうかが大切だ',
// '君の命には、黄金なんて比べ物にならないほどの価値がある',
// 'どんな夢でも大き過ぎることはないし、どんな挑戦でも大き過ぎることはない',
// 'いかなる想像も行動しなければ何も意味がない。',
// '出来ると決断することだ。方法は後から見つければいいのだ。',
// '世界を動かそうと思ったら、まず自分自身を動かせ。',
// '何もチャレンジしないのならば人生とは何の意味があるのだ？',
// '人生は一度きり。だから楽しむべきよ。',
// '失敗は選択肢にはない。誰もが成功しなければならない',
// 'まず最初に考える。第二に信じる。第三に夢見る。そして最後に思い切りやる',
// '誰もがスターなのよ。みんなが輝く権利を持っている。',
// '私は一日たりとも、いわゆる労働などしたことがない。何をやっても楽しくてたまらないからだ。',
// '他人の賞賛や非難など一切気にしない。自分自身の感性に従うのみだ。',
// '自分の生きる人生を愛せ。自分の愛する人生を生きろ',
// '人生はどちらかです。勇気をもって挑むか、棒にふるか。',
// '自分で自分をあきらめなければ、人生に「負け」はない。',
// '「どんな人だって成功できる」自分にそう何度も言い聞かせ続けていれば、絶対に成功できるのです。',
// '失敗すればやり直せばいい。やり直してダメなら、もう一度工夫し、もう一度やり直せばいい。',
// '信じて投げて打たれるのはいい。信じて投げて打たれたのなら、それは結果。一番いけないのは、やる前から打たれたらどうしようと考えること。',
// '私は決して障害に屈しはしない。いかなる障害も、私の中に強い決意を生み出すまでだ。',
// '成果が出ないときこそ、不安がらずに、恐れずに、迷わずに一歩一歩進めるかどうかが、成長の分岐点であると考えています。',
// 'あせってはいけません。ただ、牛のように、図々しく進んで行くのが大事です。',
// 'みんな自分の能力を疑いすぎるのです。自分で自分を疑っていては、最善を尽くすことなんてできないんです。自分が信じなかったとしたら、誰が信じてくれるのでしょう？',
// 'もし飛べないなら走ればいい。走れないのなら歩けばいい。歩けないのであれば、這っていけばいい。何があっても前に進み続けなければならなのです',
// '私たちがここにいるのには理由があります。 松明を掲げて、暗闇の中にいる人々を導く役割があると信じています',
// 'もしも誰かがあなたを傷付けてきたら、川のような量の涙を流したって良い。大切なのは、そこに橋をかけて乗り越えることよ',
// '被害者ではなく、人生のヒロインでありなさい',
// '努力なくして力なし',
// '小さな事に忠実でありなさい。そこにあなたの強さが宿るのですから',
// '頭ではなく、心に従って下さい',
// '「行動に気をつけなさい、それはいつか習慣になるから。」 「習慣に気をつけなさい、それはいつか性格になるから。」 「性格に気をつけなさい、それはいつか運命になるから。」',
// '成功を祝うのはいいが、もっと大切なのは失敗から学ぶことだ',
// ];
// var a = Math.floor(Math.random() * meigen_human.length);
// var meigen = meigen_human[a];
// //名言を言った人たち
// var human =['ウォルト・ディズニー',
// '松岡修造',
// 'マリリン・モンロー',
// 'サン・デグジュペリ',
// 'ブルース・リー',
// 'メイ・ウエスト',
// 'ビヨンセ',
// 'タイラー・ベリー',
// 'ヴィンス・ロンバルディ',
// 'ボブ・マーリー',
// 'ドナルド・トランプ',
// 'チャールズ。チャップリン',
// 'エイブラハム・リンカーン',
// 'ソクラテス',
// 'フィンセント・ファン・ゴッホ',
// 'ココ・シャネル',
// 'アーノルド・シュワルツェネッガー',
// 'ウォルト・ディズニー',
// 'マリリン・モロー',
// 'トーマス・エジソン',
// 'モーツァルト',
// 'ボブ・マーリー',
// 'ヘレン・ケラー',
// '斎藤　茂太',
// 'ジョン・レノン',
// '松下幸之助',
// '落合博満',
// 'レオナルド・ダ・ヴィンチ',
// '羽生義治',
// '夏目漱石',
// 'マイケル・ジャクソン',
// 'マーティン・ルーサー・キング・ジュニア',
// 'ウーピー・ゴールドバーグ',
// 'テイラー・スウィフト',
// 'ノーラ・エフロン',
// 'オプラ・ウィンフリー',
// 'マザー・テレサ',
// 'ダイアナ妃',
// 'マザー・テレサ',
// 'ビル・ゲイツ',
// ];
// var hito = human[a];

// humanのやつ
function start_button_1() {
    const yurasu = document.getElementById('img_yureru');
    if (yurasu.className == null || yurasu.className == "") {
        yurasu.className = 'omikuji_img';
    }
    const StartButton = document.getElementById("button_start_1");
    const StopButton = document.getElementById("button_stop_1");
    StartButton.style.display = 'none';
    StopButton.style.display = 'block';
}

function stop_button_1() {
    const yurasu = document.getElementById('img_yureru');
    yurasu.className = '';
    const StartButton = document.getElementById("button_start_1");
    const StopButton = document.getElementById("button_stop_1");
    StartButton.style.display = 'block';
    StopButton.style.display = 'none';
    location.href ='./human1-2.html';
}